//***//জাভাস্ক্রিপ্টে == এবং === হল তুলনা অপারেটর, কিন্তু এদের মধ্যে একটি গুরুত্বপূর্ণ পার্থক্য রয়েছে।

//== অপারেটর: == অপারেটরটি দুইটি মান তুলনা করে এবং টাইপ কনভার্সন (type conversion) করে, অর্থাৎ ভিন্ন টাইপের দুইটি মানকে একই টাইপে কনভার্ট করে তাদের তুলনা করে।
//উদাহরণ:-
console.log(5 == '5');  //output: true
console.log(0 == false); //output: true
console.log(null == undefined); //output: true
console.log(1 == true); //output: true
console.log('' == false); //output: true

//=== অপারেটর: === অপারেটরটি দুইটি মানের মান এবং টাইপ দুটোই তুলনা করে, অর্থাৎ কোনও টাইপ কনভার্সন ছাড়াই সরাসরি তুলনা করে।
//উদাহরণ:-
console.log(5 === '5');  //output: false
console.log(0 === false); //output: false
console.log(null === undefined); //output: false
console.log(1 === true); //output: false
console.log('' === false); //output: false


//***//Implicit Conversion : Implicit Conversion বা টাইপ কনভার্শন হল জাভাস্ক্রিপ্টের একটি প্রক্রিয়া যেখানে এটি স্বয়ংক্রিয়ভাবে একটি মানের টাইপ পরিবর্তন করে একে অন্য টাইপে কনভার্ট করে। এটি তখন ঘটে যখন ভিন্ন টাইপের মান একসাথে মিশ্রিত বা তুলনা করা হয়। এটি "টাইপ কোরেশন" নামেও পরিচিত। উদাহরণ:-

//সংখ্যা এবং স্ট্রিং মেশানো:
let result01 = 5 + "10";
console.log(result01); //output: 510
//এখানে, সংখ্যা 5 এবং স্ট্রিং "10" কে একসাথে যোগ করা হয়েছে। জাভাস্ক্রিপ্ট স্বয়ংক্রিয়ভাবে সংখ্যা 5 কে স্ট্রিংয়ে কনভার্ট করে এবং স্ট্রিং কনক্যাটেনেশন করে ফলাফল "510" প্রদান করে।

//সংখ্যা এবং বুলিয়ান মেশানো:
let result02 = 1 + true;
console.log(result02); //output: 2
//এখানে, সংখ্যা 1 এবং বুলিয়ান true কে একসাথে যোগ করা হয়েছে। জাভাস্ক্রিপ্ট স্বয়ংক্রিয়ভাবে true কে সংখ্যা 1 এ কনভার্ট করে এবং যোগফল 2 প্রদান করে।

//স্ট্রিং এবং বুলিয়ান মেশানো:
let result03 = "hello" + false;
console.log(result03); //output: hellofalse
//এখানে, স্ট্রিং "hello" এবং বুলিয়ান false কে একসাথে যোগ করা হয়েছে। জাভাস্ক্রিপ্ট স্বয়ংক্রিয়ভাবে false কে স্ট্রিংয়ে কনভার্ট করে এবং স্ট্রিং কনক্যাটেনেশন করে ফলাফল "hellofalse" প্রদান করে।

//স্ট্রিং এবং সংখ্যা তুলনা করা:
let result04 = "5" > 3;
console.log(result04); //output: true
//এখানে, স্ট্রিং "5" এবং সংখ্যা 3 কে তুলনা করা হয়েছে। জাভাস্ক্রিপ্ট স্বয়ংক্রিয়ভাবে স্ট্রিং "5" কে সংখ্যা 5 এ কনভার্ট করে এবং তুলনা করে ফলাফল true প্রদান করে।